Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
              description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoRabbitMQ
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoRabbitMQ
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[20] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoredis.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoredis.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoRedis
                listKind: KuberoRedisList
                plural: kuberoredis
                singular: kuberoredis
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoRedis is the Schema for the kuberoredis API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoRedis
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoRedis
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[21] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccount"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[22] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-role"
      + namespace               = "kubero-operator-system"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              name: kubero-operator-leader-election-role
              namespace: kubero-operator-system
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
              - create
              - update
              - patch
              - delete
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - get
              - list
              - watch
              - create
              - update
              - patch
              - delete
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[23] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmemcached-admin-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmemcached-admin-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[24] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmemcached-editor-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmemcached-editor-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[25] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmemcached-viewer-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmemcached-viewer-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[26] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmongodb-admin-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmongodb-admin-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[27] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmongodb-editor-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmongodb-editor-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[28] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmongodb-viewer-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmongodb-viewer-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[29] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmysql-admin-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmysql-admin-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[30] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmysql-editor-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmysql-editor-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[31] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonmysql-viewer-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonmysql-viewer-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[32] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonpostgres-admin-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonpostgres-admin-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[33] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonpostgres-editor-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonpostgres-editor-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[34] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonpostgres-viewer-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonpostgres-viewer-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[35] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonrabbitmq-admin-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonrabbitmq-admin-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[36] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonrabbitmq-editor-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonrabbitmq-editor-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[37] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonrabbitmq-viewer-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonrabbitmq-viewer-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[38] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonredis-admin-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonredis-admin-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[39] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonredis-editor-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonredis-editor-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[40] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-kuberoaddonredis-viewer-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/managed-by: kustomize
                app.kubernetes.io/name: kubero-operator
              name: kubero-operator-kuberoaddonredis-viewer-role
            rules:
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis/status
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[41] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: kubero-operator-manager-role
            rules:
            - apiGroups:
              - ""
              resources:
              - namespaces
              verbs:
              - get
            - apiGroups:
              - ""
              - apps
              resources:
              - configmaps
              - secrets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
            - apiGroups:
              - rbac.authorization.k8s.io
              - ""
              resources:
              - roles
              - clusterroles
              - clusterrolebindings
              - rolebindings
              - secrets
              - deployments
              - namespaces
              - services
              - ingresses
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoapps
              - kuberoapps/status
              - kuberoapps/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              - ""
              resources:
              - deployments
              - serviceaccounts
              verbs:
              - '*'
            - apiGroups:
              - autoscaling
              resources:
              - horizontalpodautoscalers
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              - ""
              resources:
              - ingresses
              - rolebindings
              - services
              - jobs
              verbs:
              - '*'
            - apiGroups:
              - batch
              resources:
              - cronjobs
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - opstreelabs.in
              resources:
              - mongodbs
              verbs:
              - '*'
            - apiGroups:
              - redis.redis.opstreelabs.in
              resources:
              - redis
              - redisclusters
              verbs:
              - '*'
            - apiGroups:
              - postgres-operator.crunchydata.com
              resources:
              - postgresclusters
              verbs:
              - '*'
            - apiGroups:
              - minio.min.io
              resources:
              - tenants
              verbs:
              - '*'
            - apiGroups:
              - charts.operatorhub.io
              resources:
              - cockroachdbs
              verbs:
              - '*'
            - apiGroups:
              - apiextensions.k8s.io
              resources:
              - customresourcedefinitions
              verbs:
              - '*'
            - apiGroups:
              - networking.cfargotunnel.com
              resources:
              - tunnels
              - tunnelbindings
              verbs:
              - '*'
            - apiGroups:
              - clickhouse.altinity.com
              resources:
              - clickhouseinstallations
              verbs:
              - '*'
            - apiGroups:
              - postgresql.cnpg.io
              resources:
              - clusters
              verbs:
              - '*'
            - apiGroups:
              - elasticsearch.k8s.elastic.co
              resources:
              - elasticsearches
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoes
              - kuberoes/status
              - kuberoes/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              - persistentvolumeclaims/finalizers
              - persistentvolumes/finalizers
              verbs:
              - '*'
            - apiGroups:
              - operators.coreos.com
              resources:
              - clusterserviceversions
              verbs:
              - '*'
            - apiGroups:
              - cert-manager.io
              resources:
              - certificates
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberopipelines
              - kuberopipelines/status
              - kuberopipelines/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - namespaces
              - secrets
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberomysqls
              - kuberomysqls/status
              - kuberomysqls/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberopostgresqls
              - kuberopostgresqls/status
              - kuberopostgresqls/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoredis
              - kuberoredis/status
              - kuberoredis/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberomongodbs
              - kuberomongodbs/status
              - kuberomongodbs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoelasticsearches
              - kuberoelasticsearches/status
              - kuberoelasticsearches/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberocouchdbs
              - kuberocouchdbs/status
              - kuberocouchdbs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberokafkas
              - kuberokafkas/status
              - kuberokafkas/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - deployments
              - statefulsets
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - secrets
              - configmaps
              - serviceaccounts
              - services
              - persistentvolumeclaims
              - persistentvolumes
              verbs:
              - '*'
            - apiGroups:
              - job
              resources:
              - batch
              verbs:
              - '*'
            - apiGroups:
              - policy
              resources:
              - poddisruptionbudgets
              verbs:
              - '*'
            - apiGroups:
              - networking.k8s.io
              resources:
              - networkpolicies
              verbs:
              - '*'
            - apiGroups:
              - rbac.authorization.k8s.io
              resources:
              - roles
              - rolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberomails
              - kuberomails/status
              - kuberomails/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberorabbitmqs
              - kuberorabbitmqs/status
              - kuberorabbitmqs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberomemcacheds
              - kuberomemcacheds/status
              - kuberomemcacheds/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoprometheuses
              - kuberoprometheuses/status
              - kuberoprometheuses/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - clusterrolebindings
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberobuilds
              - kuberobuilds/status
              - kuberobuilds/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - batch
              resources:
              - jobs
              verbs:
              - '*'
            - apiGroups:
              - ""
              resources:
              - pods
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmysqls
              - kuberoaddonmysqls/status
              - kuberoaddonmysqls/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonpostgres
              - kuberoaddonpostgres/status
              - kuberoaddonpostgres/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonredis
              - kuberoaddonredis/status
              - kuberoaddonredis/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonrabbitmqs
              - kuberoaddonrabbitmqs/status
              - kuberoaddonrabbitmqs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmongodbs
              - kuberoaddonmongodbs/status
              - kuberoaddonmongodbs/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
            - apiGroups:
              - application.kubero.dev
              resources:
              - kuberoaddonmemcacheds
              - kuberoaddonmemcacheds/status
              - kuberoaddonmemcacheds/finalizers
              verbs:
              - create
              - delete
              - get
              - list
              - patch
              - update
              - watch
            - apiGroups:
              - ""
              resources:
              - serviceaccounts
              - services
              verbs:
              - '*'
            - apiGroups:
              - apps
              resources:
              - deployments
              verbs:
              - '*'
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[42] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-metrics-reader"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: kubero-operator-metrics-reader
            rules:
            - nonResourceURLs:
              - /metrics
              verbs:
              - get
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[43] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterRole"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-proxy-role"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.